using MiniHttpServer.shared;
using System.Net;
using System.Security.Cryptography.X509Certificates;
using System.Text;
using System.Text.Json;

// 0. Добавить логирование работы сервера(writeline)
// 1. В папке public искать index.html. Если его нет не запускать сервер и выводить сообщение в консоль.
// 2. Из файла settings вытащить настройки сервера, а именно: путь к статическим файлам (PublicDirectoryPath,
// Domain, Port)
// 3. Брать настройки из файла settings.json. Если файла нет или ошибка в настройках, выводить сообщение и не запускать сервер.
// 4. Обрабатывать более одного запроса
// 5*. Необходимо остановить сервер  при написанной команде "/stop"

//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\///\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/

// Добавить отправку статических файлов:
// Корректно определять тип контента.
// Реализовать отправку любых статических файлов из папки static.
// Улучшить логику передачи файлов, напрямую отправлять файлы, без их открытия.
// Улучшить логику поиска index.html файла:
// Если путь к ресурсу  (URL) заканчивается на '/' искать в данном каталоге файл index.html по умолчанию
// Если файл не найден, сервер возвращает статус код 404

bool keepRunning = true;

// Загружаем настройки и запускаем сервер
var server = new HttpServer();
server.Start();

while (keepRunning) { }

server.Stop();